Tekla.Structures.Geometry3d.SegmentConversions
The Tekla.Structures.Geometry3d.SegmentConversions class converts structures representing segments
from Tekla.Structures.Geometry3d to Tekla.Common.Geometry and back.

Tekla.Structures.Geometry3d.SegmentConversions.ToSegment3(Tekla.Structures.Geometry3d.LineSegment)
Converts a Tekla.Structures.Geometry3d.LineSegment to a Tekla.Common.Geometry.Segment3.
lineSegment: The Tekla.Structures.Geometry3d.LineSegment to convert.
Returns: The resulting Tekla.Common.Geometry.Segment3.

Tekla.Structures.Geometry3d.SegmentConversions.ToSegment3List(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.LineSegment})
Creates a list of Tekla.Common.Geometry.Segment3 values from an System.Collections.Generic.IEnumerable`1 of Tekla.Structures.Geometry3d.LineSegment values.
lineSegments: The collection of Tekla.Structures.Geometry3d.LineSegment values to convert.
Returns: The resulting list of Tekla.Common.Geometry.Segment3 values.

Tekla.Structures.Geometry3d.SegmentConversions.ToPolySegment3(Tekla.Structures.Model.Polygon)
Converts a Tekla.Structures.Model.Polygon to a Tekla.BIM.Geometry.PolySegment3.
polygon: The Tekla.Structures.Model.Polygon to convert.
Returns: The resulting Tekla.BIM.Geometry.PolySegment3.

Tekla.Structures.Geometry3d.SegmentConversions.ToPolySegment3(Tekla.Structures.Geometry3d.PolyLine)
Converts a Tekla.Structures.Geometry3d.PolyLine to a Tekla.BIM.Geometry.PolySegment3.
polyLine: The Tekla.Structures.Geometry3d.PolyLine to convert.
Returns: The resulting Tekla.BIM.Geometry.PolySegment3.

Tekla.Structures.Geometry3d.SegmentConversions.ToLineSegment(Tekla.Common.Geometry.Segment3)
Converts a Tekla.Common.Geometry.Segment3 to a Tekla.Structures.Geometry3d.LineSegment.
segment: The Tekla.Common.Geometry.Segment3 to convert.
Returns: The resulting Tekla.Structures.Geometry3d.LineSegment.

Tekla.Structures.Geometry3d.SegmentConversions.ToLineSegmentList(System.Collections.Generic.IEnumerable{Tekla.Common.Geometry.Segment3})
Creates a list of Tekla.Structures.Geometry3d.LineSegment values from an System.Collections.Generic.IEnumerable`1 of Tekla.Common.Geometry.Segment3 values.
segments: The collection of Tekla.Common.Geometry.Segment3 values to convert.
Returns: The resulting list of Tekla.Structures.Geometry3d.LineSegment values.